## ✅ Terraform Plan (Staging) SUCCESS

<details>
<summary>Click to expand plan output</summary>

```

> autonyan-cloud-functions@1.0.0 terraform:plan
> npm run build:function && terraform -chdir=terraform plan -lock-timeout=5m


> autonyan-cloud-functions@1.0.0 build:function
> ./scripts/build-function.sh

Copying shared utilities...
  - Copying shared utilities to text-firebase-writer...
  - Copying shared utilities to doc-processor...
  - Copying shared utilities to drive-scanner...
  - Copying shared utilities to text-vision-processor...
  - Copying shared utilities to file-classifier...
Building shared module...

> autonyan-shared@1.0.0 build
> tsc

Building TypeScript...

> autonyan-cloud-functions@1.0.0 build
> npm run build --workspaces


> doc-processor-function@1.0.0 build
> tsc


> drive-scanner-function@1.0.0 build
> tsc


> file-classifier@1.0.0 build
> tsc


> text-firebase-writer@1.0.0 build
> tsc


> text-vision-processor@1.0.0 build
> tsc


> autonyan-shared@1.0.0 build
> tsc

Preparing function packages...
  - Preparing text-firebase-writer function package...
  - Preparing doc-processor function package...
  - Preparing drive-scanner function package...
  - Preparing text-vision-processor function package...
  - Preparing file-classifier function package...
Creating function zips...
  - Creating text-firebase-writer function zip...
  adding: index.ts (deflated 70%)
  adding: package.json (deflated 59%)
  adding: shared/ (stored 0%)
  adding: shared/index.ts (deflated 10%)
  adding: shared/parameter-parser.ts (deflated 71%)
  adding: tsconfig.json (deflated 42%)
  - Creating doc-processor function zip...
  adding: index.ts (deflated 67%)
  adding: package.json (deflated 57%)
  adding: shared/ (stored 0%)
  adding: shared/index.ts (deflated 10%)
  adding: shared/parameter-parser.ts (deflated 71%)
  adding: tsconfig.json (deflated 42%)
  - Creating drive-scanner function zip...
  adding: index.ts (deflated 64%)
  adding: package.json (deflated 58%)
  adding: shared/ (stored 0%)
  adding: shared/index.ts (deflated 10%)
  adding: shared/parameter-parser.ts (deflated 71%)
  adding: tsconfig.json (deflated 42%)
  - Creating text-vision-processor function zip...
  adding: index.ts (deflated 68%)
  adding: package.json (deflated 59%)
  adding: shared/ (stored 0%)
  adding: shared/index.ts (deflated 10%)
  adding: shared/parameter-parser.ts (deflated 71%)
  adding: tsconfig.json (deflated 41%)
  - Creating file-classifier function zip...
  adding: drive-operations.ts (deflated 60%)
  adding: classification.ts (deflated 57%)
  adding: index.ts (deflated 69%)
  adding: firestore-operations.ts (deflated 65%)
  adding: package.json (deflated 55%)
  adding: shared/ (stored 0%)
  adding: shared/index.ts (deflated 10%)
  adding: shared/parameter-parser.ts (deflated 71%)
  adding: tsconfig.json (deflated 48%)
Cleaning up shared utilities...
Build complete! Function zips created:
  - dist/functions/text-firebase-writer.zip
  - dist/functions/doc-processor.zip
  - dist/functions/drive-scanner.zip
  - dist/functions/text-vision-processor.zip
  - dist/functions/file-classifier.zip
Acquiring state lock. This may take a few moments...
module.drive_scanner.google_service_account.drive_scanner_sa: Refreshing state... [id=projects/home-hack-388806/serviceAccounts/staging-drive-scanner-sa@home-hack-388806.iam.gserviceaccount.com]
google_project_service.cloudfunctions_api: Refreshing state... [id=home-hack-388806/cloudfunctions.googleapis.com]
module.text_vision_processor.google_service_account.text_vision_processor: Refreshing state... [id=projects/home-hack-388806/serviceAccounts/staging-text-vision-proc@home-hack-388806.iam.gserviceaccount.com]
module.doc_processor.google_service_account.doc_processor_sa: Refreshing state... [id=projects/home-hack-388806/serviceAccounts/staging-doc-processor-sa@home-hack-388806.iam.gserviceaccount.com]
module.drive_scanner.google_pubsub_topic.drive_scan_trigger: Refreshing state... [id=projects/home-hack-388806/topics/staging-drive-scan-trigger]
google_storage_bucket.vision_results: Refreshing state... [id=home-hack-388806-staging-vision-results]
google_project_service.vision_api: Refreshing state... [id=home-hack-388806/vision.googleapis.com]
module.text_firebase_writer.google_service_account.text_firebase_writer: Refreshing state... [id=projects/home-hack-388806/serviceAccounts/staging-text-fb-writer@home-hack-388806.iam.gserviceaccount.com]
google_storage_bucket.document_storage: Refreshing state... [id=home-hack-388806-staging-document-storage]
google_storage_bucket.function_bucket: Refreshing state... [id=home-hack-388806-staging-function-source]
google_project_service.firestore_api: Refreshing state... [id=home-hack-388806/firestore.googleapis.com]
google_project_service.drive_api: Refreshing state... [id=home-hack-388806/drive.googleapis.com]
module.doc_processor.google_pubsub_topic.doc_process_trigger: Refreshing state... [id=projects/home-hack-388806/topics/staging-doc-process-trigger]
google_project_service.vertex_ai_api: Refreshing state... [id=home-hack-388806/aiplatform.googleapis.com]
data.google_storage_project_service_account.gcs_account: Reading...
google_project_service.pubsub_api: Refreshing state... [id=home-hack-388806/pubsub.googleapis.com]
module.text_firebase_writer.google_project_iam_member.text_firebase_writer_firestore: Refreshing state... [id=home-hack-388806/roles/datastore.user/serviceAccount:staging-text-fb-writer@home-hack-388806.iam.gserviceaccount.com]
data.google_storage_project_service_account.gcs_account: Read complete after 0s [id=service-740634168833@gs-project-accounts.iam.gserviceaccount.com]
module.text_vision_processor.google_project_iam_member.text_vision_processor_vision: Refreshing state... [id=home-hack-388806/roles/ml.developer/serviceAccount:staging-text-vision-proc@home-hack-388806.iam.gserviceaccount.com]
module.drive_scanner.google_project_iam_member.service_usage: Refreshing state... [id=home-hack-388806/roles/serviceusage.serviceUsageConsumer/serviceAccount:staging-drive-scanner-sa@home-hack-388806.iam.gserviceaccount.com]
module.drive_scanner.google_project_iam_member.storage_access: Refreshing state... [id=home-hack-388806/roles/storage.objectViewer/serviceAccount:staging-drive-scanner-sa@home-hack-388806.iam.gserviceaccount.com]
module.drive_scanner.google_project_iam_member.pubsub_publisher: Refreshing state... [id=home-hack-388806/roles/pubsub.publisher/serviceAccount:staging-drive-scanner-sa@home-hack-388806.iam.gserviceaccount.com]
module.doc_processor.google_project_iam_member.doc_processor_service_usage: Refreshing state... [id=home-hack-388806/roles/serviceusage.serviceUsageConsumer/serviceAccount:staging-doc-processor-sa@home-hack-388806.iam.gserviceaccount.com]
module.doc_processor.google_project_iam_member.doc_processor_storage_access: Refreshing state... [id=home-hack-388806/roles/storage.objectAdmin/serviceAccount:staging-doc-processor-sa@home-hack-388806.iam.gserviceaccount.com]
google_project_iam_member.gcs_pubsub_publisher: Refreshing state... [id=home-hack-388806/roles/pubsub.publisher/serviceAccount:service-740634168833@gs-project-accounts.iam.gserviceaccount.com]
google_cloud_scheduler_job.drive_scan_schedule: Refreshing state... [id=projects/home-hack-388806/locations/asia-northeast1/jobs/staging-drive-scan-schedule]
module.text_firebase_writer.google_storage_bucket_iam_member.text_firebase_writer_document_storage: Refreshing state... [id=b/home-hack-388806-staging-document-storage/roles/storage.objectViewer/serviceAccount:staging-text-fb-writer@home-hack-388806.iam.gserviceaccount.com]
module.text_vision_processor.google_storage_bucket_iam_member.text_vision_processor_document_storage: Refreshing state... [id=b/home-hack-388806-staging-document-storage/roles/storage.objectViewer/serviceAccount:staging-text-vision-proc@home-hack-388806.iam.gserviceaccount.com]
module.text_vision_processor.google_storage_bucket_iam_member.text_vision_processor_vision_results: Refreshing state... [id=b/home-hack-388806-staging-vision-results/roles/storage.objectAdmin/serviceAccount:staging-text-vision-proc@home-hack-388806.iam.gserviceaccount.com]
module.text_firebase_writer.google_storage_bucket_iam_member.text_firebase_writer_vision_results: Refreshing state... [id=b/home-hack-388806-staging-vision-results/roles/storage.objectViewer/serviceAccount:staging-text-fb-writer@home-hack-388806.iam.gserviceaccount.com]
module.doc_processor.google_storage_bucket_object.doc_processor_zip: Refreshing state... [id=home-hack-388806-staging-function-source-doc-processor.zip]
module.text_vision_processor.google_storage_bucket_object.text_vision_processor_zip: Refreshing state... [id=home-hack-388806-staging-function-source-text-vision-processor.zip]
module.text_firebase_writer.google_storage_bucket_object.text_firebase_writer_zip: Refreshing state... [id=home-hack-388806-staging-function-source-text-firebase-writer.zip]
module.drive_scanner.google_storage_bucket_object.drive_scanner_zip: Refreshing state... [id=home-hack-388806-staging-function-source-drive-scanner.zip]
module.doc_processor.google_cloudfunctions2_function.doc_processor: Refreshing state... [id=projects/home-hack-388806/locations/asia-northeast1/functions/staging-doc-processor]
module.text_vision_processor.google_cloudfunctions2_function.text_vision_processor: Refreshing state... [id=projects/home-hack-388806/locations/asia-northeast1/functions/staging-text-vision-processor]
module.text_firebase_writer.google_cloudfunctions2_function.text_firebase_writer: Refreshing state... [id=projects/home-hack-388806/locations/asia-northeast1/functions/staging-text-firebase-writer]
module.drive_scanner.google_cloudfunctions2_function.drive_scanner: Refreshing state... [id=projects/home-hack-388806/locations/asia-northeast1/functions/staging-drive-scanner]
google_firestore_database.default: Refreshing state... [id=projects/home-hack-388806/databases/(default)]
module.file_classifier.google_service_account.file_classifier: Refreshing state... [id=projects/home-hack-388806/serviceAccounts/staging-file-classifier@home-hack-388806.iam.gserviceaccount.com]
module.file_classifier.google_storage_bucket_object.file_classifier_zip: Refreshing state... [id=home-hack-388806-staging-function-source-file-classifier.zip]
module.file_classifier.google_project_iam_member.file_classifier_invoker: Refreshing state... [id=home-hack-388806/roles/run.invoker/serviceAccount:staging-file-classifier@home-hack-388806.iam.gserviceaccount.com]
module.file_classifier.google_project_iam_member.file_classifier_firestore: Refreshing state... [id=home-hack-388806/roles/datastore.user/serviceAccount:staging-file-classifier@home-hack-388806.iam.gserviceaccount.com]
module.file_classifier.google_project_iam_member.file_classifier_vertex_ai: Refreshing state... [id=home-hack-388806/roles/aiplatform.user/serviceAccount:staging-file-classifier@home-hack-388806.iam.gserviceaccount.com]
module.file_classifier.google_project_iam_member.file_classifier_eventarc: Refreshing state... [id=home-hack-388806/roles/eventarc.eventReceiver/serviceAccount:staging-file-classifier@home-hack-388806.iam.gserviceaccount.com]
module.file_classifier.google_cloudfunctions2_function.file_classifier: Refreshing state... [id=projects/home-hack-388806/locations/asia-northeast1/functions/staging-file-classifier]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # google_cloud_scheduler_job.drive_scan_schedule will be updated in-place
  ~ resource "google_cloud_scheduler_job" "drive_scan_schedule" {
      ~ attempt_deadline = "0s" -> "180s"
        id               = "projects/home-hack-388806/locations/asia-northeast1/jobs/staging-drive-scan-schedule"
        name             = "staging-drive-scan-schedule"
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.doc_processor.google_cloudfunctions2_function.doc_processor will be updated in-place
  ~ resource "google_cloudfunctions2_function" "doc_processor" {
        id               = "projects/home-hack-388806/locations/asia-northeast1/functions/staging-doc-processor"
        name             = "staging-doc-processor"
        # (11 unchanged attributes hidden)

      ~ build_config {
            # (7 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ generation = 1765725019166322 -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.doc_processor.google_storage_bucket_object.doc_processor_zip will be updated in-place
  ~ resource "google_storage_bucket_object" "doc_processor_zip" {
      ~ crc32c              = "lQThew==" -> (known after apply)
      ~ detect_md5hash      = "V/U83ospDoWJh672PS9M+A==" -> "different hash"
      ~ generation          = 1765725019166322 -> (known after apply)
        id                  = "home-hack-388806-staging-function-source-doc-processor.zip"
      ~ md5hash             = "V/U83ospDoWJh672PS9M+A==" -> (known after apply)
        name                = "doc-processor.zip"
        # (17 unchanged attributes hidden)
    }

  # module.drive_scanner.google_cloudfunctions2_function.drive_scanner will be updated in-place
  ~ resource "google_cloudfunctions2_function" "drive_scanner" {
        id               = "projects/home-hack-388806/locations/asia-northeast1/functions/staging-drive-scanner"
        name             = "staging-drive-scanner"
        # (11 unchanged attributes hidden)

      ~ build_config {
            # (7 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ generation = 1765725019172163 -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.drive_scanner.google_storage_bucket_object.drive_scanner_zip will be updated in-place
  ~ resource "google_storage_bucket_object" "drive_scanner_zip" {
      ~ crc32c              = "MLiVqQ==" -> (known after apply)
      ~ detect_md5hash      = "GymSRuOECqDqX0dQNeIT2g==" -> "different hash"
      ~ generation          = 1765725019172163 -> (known after apply)
        id                  = "home-hack-388806-staging-function-source-drive-scanner.zip"
      ~ md5hash             = "GymSRuOECqDqX0dQNeIT2g==" -> (known after apply)
        name                = "drive-scanner.zip"
        # (17 unchanged attributes hidden)
    }

  # module.file_classifier.google_cloudfunctions2_function.file_classifier will be updated in-place
  ~ resource "google_cloudfunctions2_function" "file_classifier" {
        id               = "projects/home-hack-388806/locations/asia-northeast1/functions/staging-file-classifier"
        name             = "staging-file-classifier"
        # (11 unchanged attributes hidden)

      ~ build_config {
            # (7 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ generation = 1765725019186889 -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.file_classifier.google_storage_bucket_object.file_classifier_zip will be updated in-place
  ~ resource "google_storage_bucket_object" "file_classifier_zip" {
      ~ crc32c              = "u7uU6A==" -> (known after apply)
      ~ detect_md5hash      = "0KN+nRNPHaVSznHjZFhGmg==" -> "different hash"
      ~ generation          = 1765725019186889 -> (known after apply)
        id                  = "home-hack-388806-staging-function-source-file-classifier.zip"
      ~ md5hash             = "0KN+nRNPHaVSznHjZFhGmg==" -> (known after apply)
        name                = "file-classifier.zip"
        # (17 unchanged attributes hidden)
    }

  # module.text_firebase_writer.google_cloudfunctions2_function.text_firebase_writer will be updated in-place
  ~ resource "google_cloudfunctions2_function" "text_firebase_writer" {
        id               = "projects/home-hack-388806/locations/asia-northeast1/functions/staging-text-firebase-writer"
        name             = "staging-text-firebase-writer"
        # (11 unchanged attributes hidden)

      ~ build_config {
            # (7 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ generation = 1765725019149459 -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.text_firebase_writer.google_storage_bucket_object.text_firebase_writer_zip will be updated in-place
  ~ resource "google_storage_bucket_object" "text_firebase_writer_zip" {
      ~ crc32c              = "ZJpdHg==" -> (known after apply)
      ~ detect_md5hash      = "rRcbNQKqw9R85UMX8pmvwg==" -> "different hash"
      ~ generation          = 1765725019149459 -> (known after apply)
        id                  = "home-hack-388806-staging-function-source-text-firebase-writer.zip"
      ~ md5hash             = "rRcbNQKqw9R85UMX8pmvwg==" -> (known after apply)
        name                = "text-firebase-writer.zip"
        # (17 unchanged attributes hidden)
    }

  # module.text_vision_processor.google_cloudfunctions2_function.text_vision_processor will be updated in-place
  ~ resource "google_cloudfunctions2_function" "text_vision_processor" {
        id               = "projects/home-hack-388806/locations/asia-northeast1/functions/staging-text-vision-processor"
        name             = "staging-text-vision-processor"
        # (11 unchanged attributes hidden)

      ~ build_config {
            # (7 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ generation = 1765725019158748 -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.text_vision_processor.google_storage_bucket_object.text_vision_processor_zip will be updated in-place
  ~ resource "google_storage_bucket_object" "text_vision_processor_zip" {
      ~ crc32c              = "PwXfUg==" -> (known after apply)
      ~ detect_md5hash      = "KyZKWtzfzkpyodPjbPoZug==" -> "different hash"
      ~ generation          = 1765725019158748 -> (known after apply)
        id                  = "home-hack-388806-staging-function-source-text-vision-processor.zip"
      ~ md5hash             = "KyZKWtzfzkpyodPjbPoZug==" -> (known after apply)
        name                = "text-vision-processor.zip"
        # (17 unchanged attributes hidden)
    }

Plan: 0 to add, 11 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>

*Auto-triggered after Test workflow success*